[
    {
        "tag": "regular",
        "workout": "Chest",
        "desc": "Chest day, best day!",
        "exercises": [
            {
                "name": "Bench Press",
                "desc": "Lie back on a flat bench. Using a medium width grip (a grip that creates a 90-degree angle in the middle of the movement between the forearms and the upper arms), lift the bar from the rack and hold it straight over you with your arms locked.",
                "sets": 3,
                "reps": 10,
                "rest": 0,
                "duration": 0
            },
            {
                "name": "Cable Flys",
                "desc": "Grasp two opposing high pulley dumbbell attachments. Stand with pulleys to each side. Bend over slightly by flexing hips and knees. Bend elbows slightly and internally rotate shoulders so elbows are back initially. Bring cable attachments together in hugging motion with elbows in fixed position. Keep shoulders internally rotated so elbows are pointed upward at top and out to sides at bottom. Return to starting position until chest muscles are stretched. Repeat.",
                "sets": 3,
                "reps": 10,
                "rest": 0,
                "duration": 0
            }
        ]
    },
    {
        "tag": "regular",
        "workout": "Back",
        "desc": "Back it up!",
        "exercises": [
            {
                "name": "Pull Ups",
                "desc": "Grab a bar with a grip slightly wider than shoulder width, with your hands facing away from you. Hang all the way down. Pull yourself up until your chin is above the bar. Slight pause Lower yourself all the way back down.",
                "sets": 3,
                "reps": 10,
                "rest": 0,
                "duration": 0
            },
            {
                "name": "Bent Over Barbell Row",
                "desc": "Holding a barbell with a pronated grip (palms facing down), bend your knees slightly and bring your torso forward, by bending at the waist, while keeping the back straight until it is almost parallel to the floor. Tip: Make sure that you keep the head up.",
                "sets": 3,
                "reps": 10,
                "rest": 0,
                "duration": 0
            }
        ]
    },
    {
        "tag": "regular",
        "workout": "Shoulders",
        "desc": "Turn those shoulders into Swollders!",
        "exercises": [
            {
                "name": "Military Press",
                "desc": "Grasp barbell from rack or clean barbell from floor with overhand grip, slightly wider than shoulder width. Position bar in front of neck. Press bar upward until arms are extended overhead. Lower to front of neck and repeat.",
                "sets": 3,
                "reps": 10,
                "rest": 0,
                "duration": 0
            },
            {
                "name": "Lateral Raises",
                "desc": "Grasp dumbbells in front of thighs with elbows slightly bent. Bend over slightly with hips and knees bent slightly. Raise upper arms to sides until elbows are shoulder height. Maintain elbows' height above or equal to wrists. Lower and repeat.",
                "sets": 3,
                "reps": 10,
                "rest": 0,
                "duration": 0
            }
        ]
    },
    {
        "tag": "regular",
        "workout": "Bicep",
        "desc": "Bi the whey, I lift!",
        "exercises": [
            {
                "name": "Barbell Curl",
                "desc": "Stand up with your torso upright while holding a barbell at a shoulder-width grip. The palm of your hands should be facing forward and the elbows should be close to the torso. Continue the movement until your biceps are fully contracted and the bar is at shoulder level.",
                "sets": 3,
                "reps": 10,
                "rest": 0,
                "duration": 0
            },
            {
                "name": "Concentratin Curl",
                "desc": "Sit down on a flat bench with one dumbbell in front of you between your legs. Your legs should be spread with your knees bent and feet on the floor. Use your right arm to pick the dumbbell up. While holding the upper arm stationary, curl the weights forward while contracting the biceps as you breathe out.",
                "sets": 3,
                "reps": 10,
                "rest": 0,
                "duration": 0
            }
        ]
    },
    {
        "tag": "regular",
        "workout": "Tricep",
        "desc": "Tri not to be to be impressed!",
        "exercises": [
            {
                "name": "Straight Bar Tricep Pushdown",
                "desc": "Attach a straight or angled bar to a high pulley and grab with an overhand grip (palms facing down) at shoulder width. Standing upright with the torso straight and a very small inclination forward, bring the upper arms close to your body and perpendicular to the floor.",
                "sets": 3,
                "reps": 10,
                "rest": 0,
                "duration": 0
            },
            {
                "name": "Dips",
                "desc": "Raise yourself up to an initial position with your arms extended and supporting the entire weight of your body. Next, lower yourself to a final position where your elbows are bent and your shoulders are mildly stretched.",
                "sets": 3,
                "reps": 10,
                "rest": 0,
                "duration": 0
            }
        ]
    },
    {
        "tag": "cardio",
        "workout": "Sprints",
        "desc": "Running fast for short durations.",
        "exercises": [
            {
                "name": "Short Sprints",
                "desc": "For 15 seconds, run at 80% max speed.",
                "sets": 3,
                "reps": 1,
                "rest": 10,
                "duration": 15
            },
            {
                "name": "Medium Sprints",
                "desc": "For 30 seconds, run at 70% max speed.",
                "sets": 3,
                "reps": 1,
                "rest": 20,
                "duration": 30
            }
        ]
    },
    {
        "tag": "cardio",
        "workout": "Jogging",
        "desc": "Running medium distances at medium .",
        "exercises": [
            {
                "name": "Short Jog",
                "desc": "For 5 minutes, run at 50% max speed.",
                "sets": 2,
                "reps": 1,
                "rest": 60,
                "duration": 300
            },
            {
                "name": "Medium Jog",
                "desc": "For 10 minutes, run at 50% max speed.",
                "sets": 2,
                "reps": 1,
                "rest": 120,
                "duration": 600
            }
        ]
    }
]